%mathpiper,def="AssocIndices"

AssocIndices(associndiceslist_IsList) <--
  DestructiveReverse(MapSingle("First",associndiceslist));

%/mathpiper



%mathpiper_docs,name="AssocIndices",categories="User Functions;Lists (Operations)"
*CMD AssocIndices --- return the keys in an association list
*STD
*CALL
	AssocIndices(alist)

*PARMS

{alist} -- association list to examine

*DESC

All the keys in the association list "alist" are assembled in a list
and this list is returned.

*E.G.

	In> writer := {};
	Result: {};
	In> writer["Iliad"] := "Homer";
	Result: True;
	In> writer["Henry IV"] := "Shakespeare";
	Result: True;
	In> writer["Ulysses"] := "James Joyce";
	Result: True;
	In> AssocIndices(writer);
	Result: {"Iliad","Henry IV","Ulysses"};

*SEE Assoc, AssocDelete, AssocValues
%/mathpiper_docs